# NumObj

## Description
Function NumObj returns the number of objects on the referenced layer.

```pascal
FUNCTION NumObj(h : HANDLE): LONGINT;
```

```python
def vs.NumObj(h):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to layer.|

## Version
Availability: from All Versions

## Category
* Layers